In [75]:
'''#Question1 - What value is displayed when the last expression (a) is evaluated? Explain your
answer by indicating what happens in every executed statement.'''


a = 0
def b(): # defining function b
    global a # global variable a
    a = c(a)
def c(a):
    return a + 2
b() #b function is called then a is 0 + 2 = 2
b() #b function is called then a is 2 + 2 = 4
b() #b function is called then a is 4 + 2 = 6
a

6

In [76]:
'''#question2 - Function fileLength(), given to you, takes the name of a file as input and returns
the length of the file:
>>> fileLength('midterm.py')
284
>>> fileLength('idterm.py')
Traceback (most recent call last):
File "<pyshell#34>", line 1, in <module>
 fileLength('idterm.py')
File "/Users/me/midterm.py", line 3, in fileLength
 infile = open(filename)
FileNotFoundError: [Errno 2] No such file or directory:
'idterm.py'
As shown above, if the file cannot be found by the interpreter or if it cannot be read
as a text file, an exception will be raised. Modify function fileLength() so that a
friendly message is printed instead:
'''


def fileLength(fname):
    try:
        a = open(fname,'r')
        data = a.readlines()
        line = ""
        for b in data:
            line += b
            answer = len(line)
        return answer
    except:
        print("No such file {}".format(fname))

In [77]:
print(fileLength('C:\\Users\\Acer\\Downloads\\test.txt'))

14

In [78]:
print(fileLength('test2.txt'))

No such file test2.txt
None

In [79]:
'''#Question3 - Write a class named Marsupial that can be used as shown below:
>>> m = Marsupial()
>>> m.put_in_pouch('doll')
>>> m.put_in_pouch('firetruck')
>>> m.put_in_pouch('kitten')
>>> m.pouch_contents()
['doll', 'firetruck', 'kitten']
Now write a class named Kangaroo as a subclass of Marsupial that inherits all the
attributes of Marsupial and also:
a. extends the Marsupial __init__ constructor to take, as input, the
coordinates x and y of the Kangaroo object,
b. supports method jump that takes number values dx and dy as input and
moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and
c. overloads the __str__ operator so it behaves as shown below.
'''

class Marsupial:
    def __init__(self):
        self.myItems = []
    def put_in_pouch(self, item):
        self.myItems.append(item)
    def pouch_contents(self):
        return self.myItems

#class Marsupial created
class Kangaroo(Marsupial):      
    def __init__(self,dx,dy):
        Marsupial.__init__(self)
        self.x = dx
        self.y = dy
    def jump(self,dx,dy):
        self.x = self.x + dx
        self.y = self.y + dy
    def __str__(self):
        return 'I am a Kangaroo located at coordinates ({},{})'.format(self.x, self.y)

m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [80]:
k = Kangaroo(0,0)
print (k)

I am a Kangaroo located at coordinates (0,0)

In [81]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

['doll', 'firetruck', 'kitten']

In [82]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (3,0)

In [83]:
'''#Question4 - Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x.
A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence:
x = {
𝑥/2 𝑖𝑓 𝑥 𝑖𝑠 𝑒𝑣𝑒𝑛
3𝑥 + 1 𝑖𝑓 𝑥 𝑖𝑠 𝑜𝑑𝑑
Your function should stop when the sequence gets to number 1. Your implementation must be recursive, without any loops.'''

def collatz(value):

    if value == 1:
        print(1)
        return
    print(int(value))
    if value % 2 == 0:
        return collatz(value/2)
    else:
        return collatz(value = value*3+1)  
collatz(1)

1

In [84]:
collatz(10)

10
5
16
8
4
2
1

In [85]:
'''Question5 - Write a recursive method binary() that takes a non-negativeinteger n and prints the binary representation of
integer n.'''

def binary( number ):
    if number <= 0:
        return 0
    else:
        return  number % 2 + 10 * binary(int(number / 2))

In [86]:
binary(-10)

0

In [87]:
binary(1)

1

In [88]:
binary(3)

11

In [89]:
binary(9)

1001

In [90]:
binary(10)

1010

In [140]:
'''Question6 - Implement a class named HeadingParser that can be used to parse an HTMLdocument, and retrieve and print all the
headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Librarymodule 
html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in 
which they appear in the document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 
heading should have indentation 1, etc. Test your implementation using w3c.html'''


class HeadingParser(HTMLParser):
    headers = ['h1', 'h2']

    def handle_starttag(self, tag, att):
        if tag in self.headers:
            print(tag)

    def handle_endtag(self, tag):
        if tag in self.headers:
            print(tag)

    def handle_data(self, data):
        print(data)

In [141]:
infile = open('C:/Users/Acer/Downloads/w3c.html')
content = infile.read()
infile.close()
hp = HeadingParser()
hp.feed(content)

W3C Mission


Principles

In [ ]:
'''#Question8 - Write SQL queries on the below database table that return:
a) All the temperature data.
b) All the cities, but without repetition.
c) All the records for India.
d) All the Fall records.
e) The city, country, and season for which the average rainfall is between 200
and 400 millimeters.
f) The city and country for which the average Fall temperature is above 20
degrees, in increasing temperature order.
g) The total annual rainfall for Cairo.
h) The total rainfall for each season.'''

In [157]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\acer\anaconda3\lib\site-packages (0.4.1)
Requirement already satisfied: sqlparse in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (1.4.32)
Requirement already satisfied: ipython>=1.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: stack-data in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: colorama in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: traitlets>=5 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: backcall in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (61.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\acer\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\acer\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\acer\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: asttokens in c:\users\acer\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\acer\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\acer\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)

In [160]:
%reload_ext sql

In [161]:
%sql sqlite://

In [164]:
%%sql
CREATE TABLE Info(City varchar(50), Country varchar(50), Season varchar(50), Temperature int, Rainfall int);
INSERT INTO Info VALUES('Mumbai', 'India', 'Winter', '24.8', '5.9');
INSERT INTO Info VALUES('Mumbai', 'India', 'Spring', '28.4', '16.2');
INSERT INTO Info VALUES('Mumbai', 'India', 'Summer', '27.9', '1549.4');
INSERT INTO Info VALUES('Mumbai', 'India', 'Fall', '27.6', '346.0');
INSERT INTO Info VALUES('London', 'United Kingdon', 'Winter', '4.2', '207.7');
INSERT INTO Info VALUES('London', 'United Kingdon', 'Spring', '8.3', '169.6');
INSERT INTO Info VALUES('London', 'United Kingdon', 'Summer', '15.7', '157.0');
INSERT INTO Info VALUES('London', 'United Kingdon', 'Fall', '10.4', '218.5');
INSERT INTO Info VALUES('Cairo', 'Egypt', 'Winter', '13.6', '16.5');
INSERT INTO Info VALUES('Cairo', 'Egypt', 'Spring', '20.7', '6.5');
INSERT INTO Info VALUES('Cairo', 'Egypt', 'Summer', '27.7', '0.1');
INSERT INTO Info VALUES('Cairo', 'Egypt', 'Fall', '22.2', '4.5');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [165]:
%%sql
select * from Info;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdon', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdon', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdon', 'Summer', 15.7, 157),
 ('London', 'United Kingdon', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [166]:
#a) All the temperature data.
%sql SELECT Temperature FROM Info;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [167]:
#b) All the cities, but without repetition.
%sql SELECT DISTINCT City FROM Info;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [169]:
#c) All the records for India.
%sql SELECT * FROM Info WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

In [170]:
#d) All the Fall records.
%sql SELECT * FROM Info WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdon', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [171]:
#e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.
%sql SELECT City, Country, Season FROM Info WHERE Rainfall BETWEEN 200 And 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdon', 'Winter'),
 ('London', 'United Kingdon', 'Fall')]

In [179]:
#f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.
%sql SELECT City, Country FROM Info WHERE Season = 'Fall' AND Temperature >20 ORDER BY Temperature ASC;

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [176]:
#g) The total annual rainfall for Cairo.
%sql SELECT Sum(Rainfall) as Tot_Ann_Rainfall FROM Info WHERE City='Cairo';

 * sqlite://
Done.

[(27.6,)]

In [175]:
#h) The total rainfall for each season.
%sql SELECT Season, round(Sum(Rainfall),1) as Tot_Rainfall FROM Info GROUP BY Season;

 * sqlite://
Done.

[('Fall', 569.0), ('Spring', 192.3), ('Summer', 1706.5), ('Winter', 230.1)]

In [ ]:
'''#Question9 -  Suppose list words is defined as follows:
>>> words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']
Write list comprehension expressions that use list words and generate the following
lists:
a) ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE',
'LAZY', 'DOG']
b) ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the',
'lazy', 'dog']
c) [3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list
words).
d) [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN',
'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5],
['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy',
4], ['DOG', 'dog', 3]] (the list containing a list for every word of list
words, where each list contains the word in uppercase and lowercase and the
length of the word.)
e) ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the',
'lazy', 'dog'] (the list of words in list words containing 4 or more
characters.)'''

In [93]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [181]:
print([name.upper() for name in words])

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [182]:
print([name.lower() for name in words])

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [183]:
print([len(name) for name in words])

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [184]:
print([[name.upper(), name.lower(), len(name)] for name in words])

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

In [185]:
print([name for name in words if len(name)>=4])

['quick', 'brown', 'jumps', 'over', 'lazy']